app/controllers/commits_controller.rb

  def show
    @commit = @repository.commits.find params[:id]
---
SELECT * FROM `commits` WHERE (`commits`.`id` = 44 AND (`commits`.repository_id = 10))

  def find_repository
    @repository = Repository.find params[:repository_id]
---
SELECT * FROM `repositories` WHERE (`repositories`.`id` = 10)