app/controllers/repositories_controller.rb

  def index
    # @repositories = Repository.all
    @repositories = Repository.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `repositories` ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `repositories`

  def create
    # @repository = Repository.new(params[:repository])
    push = JSON.parse(params[:payload])

    @repository = Repository.find_by_url(push["pusher"]['repository']['url'])

    if @repository

    else
      @repository.new
    end

    @repository.name = push["pusher"]['repository']['name']
    @repository.description = push["pusher"]['repository']['description']
    @repository.url = push["pusher"]['repository']['url']
    @repository.watchers = push["pusher"]['repository']['watchers']
    @repository.forks = push["pusher"]['repository']['forks']
    @repository.privateflag = push["pusher"]['repository']['private']
    @repository.homepage = push["pusher"]['repository']['homepage']
    @repository.ownername = push["pusher"]['repository']['owner']['name']
    @repository.owneremail = push["pusher"]['repository']['owner']['email']

    respond_to do |format|
      if @repository.save
---
SELECT * FROM `repositories` WHERE (`repositories`.`url` = 'http://github.com/chrismatthieu/ahnhub') LIMIT 1
INSERT INTO `repositories` (`name`, `owneremail`, `created_at`, `watchers`, `updated_at`, `url`, `privateflag`, `homepage`, `description`, `forks`, `ownername`) VALUES('ahnhub', 'chris@matthieu.us', '2010-08-15 17:01:07', 1, '2010-08-15 17:01:07', 'http://github.com/chrismatthieu/ahnhub', 0, 'http://ahnhub.com', 'Adhearsion component library', 0, 'chrismatthieu')
UPDATE `repositories` SET `updated_at` = '2010-08-15 17:57:12', `watchers` = 3 WHERE `id` = 1